import Mobira from "shared/assets/img/slides/mobira-MD59-NB2.png";
import Motorola from "shared/assets/img/slides/motorola-teletac 250.png";
import Nokia8110 from "shared/assets/img/slides/nokia-8110.png";
import Nokia3310 from "shared/assets/img/slides/nokia-3310.png";
import EricssonR320s from "shared/assets/img/slides/ericsson-R320s.png";
import SonyEricssonT610 from "shared/assets/img/slides/sony-ericsson-T610.png";
import Iphone2G from "shared/assets/img/slides/apple-iphone-2G.png";
import IPhone4 from "shared/assets/img/slides/iPhone-4.png";
import SamsungGalaxyNote from "shared/assets/img/slides/samsung-galaxy-note.png";
import HuaweiMate20Pro from "shared/assets/img/slides/huawei-mate-20 pro.png";
import Iphone11ProMax from "shared/assets/img/slides/apple-iphone-11-pro-max.png";

export const slidesData = [
    [
        {
            slideTitle: "1990",
            imgSrc: Mobira,
            leftText: {
                title: "день рождения банка",
                text: "Днем рождения банка принято считать 6 марта. В этот день «Кировский кооперативный банк» получил лицензию №254",
            },
            rightText: {
                title: "mobira MD59-NB2",
                text: 'Мэр Ленинграда Анатолий Собчак совершил первый звонок из сети первого в РФ мобильного оператора - "Дельта Телеком". Позвонил он Норману Райсу - мэру Сиэтла: в этом городе располагался офис зарубежного инвестора "Дельты", фирмы US West International. Телефон был выпущен финской компанией Nokia и весила около 3 кг.',
            },
        },
        {
            slideTitle: "1994",
            imgSrc: Motorola,
            leftText: {
                title: "у нас было...",
                text: "...5 компьютеров, факс и копировальный аппарат и печатная машинка. В зале для клиентов посетители сами могли заполнить бланк.",
            },
            rightText: {
                title: "motorola teletac 250",
                text: "У культовой модели тех лет была тонкая выдвижная антенна и индикаторный цифровой дисплей «калькуляторного» типа с зеленой или оранжевой подсветкой. Монохромный экран мог демонстрировать до 7 символов.",
            },
        },
        {
            slideTitle: "1997",
            imgSrc: Nokia8110,
            leftText: {
                title: "открыт головной офис",
                text: "с этого момента началась длинная история развития офисной сети и неустанной модернизации технологий.",
            },
            rightText: {
                title: "nokia 8110 «банан»",
                text: "В России телефон получил прозвище «Банан» из-за изогнутого корпуса, напоминающего изгиб этого фрукта.Телефон Nokia 8110 появился в эпизоде фильма Матрица, благодаря чему стал мега популярным.",
            },
        },
    ],
    [
        {
            slideTitle: "2000",
            imgSrc: Nokia3310,
            leftText: {
                title: "начали работать с валютой",
                text: "Управления маркетинга еще не было и рекламными кампаниями и продвижением занимались сотрудники кредитного отдела",
            },
            rightText: {
                title: "nokia 3310",
                text: "Одна из самых популярных моделей финской компании; она была выпущена в 2000 году и производилась до 2005 года. Всего было продано 126 миллионов таких телефонов. В результате модель 3310 стала одним из самых продаваемых кнопочных мобильных телефонов в истории.",
            },
        },
        {
            slideTitle: "2001",
            imgSrc: EricssonR320s,
            leftText: {
                title: "первые кредиты",
                text: "банк стал выдавать первые кредиты физлицам. Тогда выдавали долго и после многих согласований, а сейчас выдаем легко и быстро)",
            },
            rightText: {
                title: "ericsson R320s",
                text: "За короткий срок Ericsson R320s стал в России самым продаваемым телефоном по соотношению цена/качество Ericsson R320s не было равных.",
            },
        },
        {
            slideTitle: "2003",
            imgSrc: SonyEricssonT610,
            leftText: {
                title: "карты и банкомат",
                text: "банк начал выпускать карты российской платежной системы «Золотая корона» для физических лиц и установили первый уличный банкомат.",
            },
            rightText: {
                title: "sony ericsson T610",
                text: "Был одним из первых массовых аппаратов, имевших цветной дисплей с большим разрешением (288 х 352 пикселей), модуль Bluеtooth, джойстик навигации на клавиатуре и камеру. Благодаря качественным снимкам, его даже считают одним из первых камерафонов.",
            },
        },
        {
            slideTitle: "2007",
            imgSrc: Iphone2G,
            leftText: {
                title: "банкоматы",
                text: "Банк «Хлынов» одним из первых в регионе получил кредитный рейтинг от агентства Эксперт РА (это как Оскар у киношников)",
            },
            rightText: {
                title: "apple iphone 2G",
                text:
                    "Обозреватель The Wall Street Journal Уолт Моссберг заключил, что «несмотря на некоторые недостатки и упущения, iPhone является, в конечном счёте, красивым и прорывным карманным компьютером».\n" +
                    "Журнал Time назвал его изобретением 2007 год.",
            },
        },
    ],
    [
        {
            slideTitle: "2010",
            imgSrc: IPhone4,
            leftText: {
                title: "«Контактный центр»",
                text: "Был открыт круглосуточный центр поддержки клиентов. Тогда всего 2 сотрудника, сейчас в Информационном центре работает 25 человек.",
            },
            rightText: {
                title: "iPhone 4",
                text: "смартфон впервые получил ряд функций, которые теперь считаются обязательными в каждом устройстве. Например, iPhone 4 был первым девайсов с фронтальной камерой и поддержкой HDR. Кроме того, Apple задала тренд на использование стекла с обеих сторон корпуса, а Retina-дисплей заставил пользователей забыть о заметных пикселях на экране.",
            },
        },
        {
            slideTitle: "2011",
            imgSrc: SamsungGalaxyNote,
            leftText: {
                title: "Илья Прозоров",
                text: "ушел основатель банка Николай Попов, а на смену пришел Илья Прозоров. Новый председатель правления запустил новый сайт банка. Помимо этого, банк начал масштабный образовательный проект «Мой первый финансовый урок».",
            },
            rightText: {
                title: "samsung galaxy note",
                text: " — первый фаблет со стилусом. Аппарат позиционировался, как смартфон не только для развлечений и повседневных дел, но и для рисования, бизнеса и работы.",
            },
        },
        {
            slideTitle: "2018",
            imgSrc: HuaweiMate20Pro,
            leftText: {
                title: "первый ребрендинг",
                text: "в 2012 начали масштабное изменение бренда и брендбука. Изменили всё: от лого до оформления всех офисов.",
            },
            rightText: {
                title: "huawei mate 20 pro",
                text: "китайский рынок представил Huawei Mate 20 Pro — флагманский аппарат с тремя основными камерами. Впервые главный модуль дополняли широкоугольный объектив и макрокамера, а сейчас такой набор стоит у каждой бюджетной модели.",
            },
        },
        {
            slideTitle: "2019",
            imgSrc: Iphone11ProMax,
            leftText: {
                title: "мы в топ 10 банков ",
                text: "банк вошел в ТОП 10 банков Приволжского федерального округа. 2019 Продуктовая линейка банка «Хлынов» претерпела ряд существенных изменений. Прежде всего, это коснулось мобильных приложений для бизнеса и физических лиц: они стали проще и удобнее для пользователей. ",
            },
            rightText: {
                title: "apple iphone 11 pro max",
                text: "Cерия аппаратов XpressMusic для меломанов. В устройствах, которые должны были конкурировать с моделями линейки Walkman от SonyEricsson, акцент делался на динамиках и MP3-плеере с большим объемом памяти. ",
            },
        },
    ],
];
